/** MongoDB 소개
 * 데이터베이스를 알기전에 데이터 먼저 알아야 함
 * 데이터 - 데이터는 정보를 컴퓨터가 이해할 수 있는 형태로 저장해 놓은 정보
 * 
 * 상품 목록, 리뷰 목록, 찜 목록, 회원 데이터 등등을 JS 변수에 저장해놓고 백엔드 서버가 꺼졌다 켜지면 데이터 다 잃음
 * 이럴때 사용하는게 데이터베이스라는 프로그램
 * 백엔드 서버와는 별도로 데이터 베이스를 만들어 놓으면 데이터를 관리하기도 서버랑 데이터베이스 개수를 늘리기도 좋음
 * 
 * 데이터베이스 - 데이터를 따로 저장하고 관리하는 프로그램
 * 우리는 MongoDB를 사용할 거임
 * 데이터베이스에는 SQL, NoSQL등 여러가지 종류가 있음 => MongoDB는 NoSQL임
 * MongoDB에 저장하는 데이터는 도규먼트(Document)라고 부름 => 도규먼트는 쉽게말해 JS 객체 같은거라고 생각
 * 앞에서 말한 예시에서 상품 목록 데이터는 상품 목록 데이터끼리 이렇게 도규먼트를 모아 놓은 걸 컬렉션(collection)이라 함
 * 
 * 이번 챕터에서는 MongoDB Atlas라는 서비스를 이용해서 클라우드에 MongoDB 데이터베이스를 생성할 거고
 * Mongoose라는 JS 라이브러리로 서버에서 MongoDB를 다뤄볼거임
 */